(function () {
    'use strict';

    angular.module('app')
        .controller('DashboardCountCtrl', ['$scope', DashboardCountCtrl])

    function DashboardCountCtrl($scope) {

        var departments = ['儿科急诊','普外科急诊','急诊内科','针灸科门诊','老年科门诊','消化科门诊','产科门诊','普外科门诊','儿科门诊','风湿病科门诊','耳鼻咽喉科门诊','胸外科急诊','妇科门诊','普内科门诊','神经内科门诊','血液科门诊','骨科急诊','心内科门诊','骨科门诊','肾内科门诊','神经内科急诊','泌尿科门诊','皮肤科门诊','眼科门诊','口腔科门诊','呼吸科门诊','疼痛科门诊','泌尿科急诊','胸外科门诊','内分泌科门诊','中医科门诊','神外科急诊','门诊计划生育','妇科急诊','神外科门诊','健康管理中心','肾内科血透中心','生殖医学科门诊','心血管外科门诊','血管外科急诊','血管外科门诊','营养科门诊','超声医学科门诊','内窥镜门诊','麻醉科门诊','肿瘤微创介入科门诊','高压氧舱','放射诊疗科门诊','膏方门诊','耳鼻咽喉科急诊','放射科门诊','发热门诊','眼科急诊'];
        var months = ['2016/01','2016/02','2016/03','2016/04','2016/05','2016/06','2016/07','2016/08','2016/09'];

        var dataGrowthYearByDepartments = [
            ['2016/01','中医科门诊',0.258604207],
            ['2016/01','产科门诊',0.694557271],
            ['2016/01','健康管理中心',1.112781955],
            ['2016/01','儿科急诊',-0.268981019],
            ['2016/01','儿科门诊',-0.048249288],
            ['2016/01','内分泌科门诊',0.459388646],
            ['2016/01','内窥镜门诊',null],
            ['2016/01','口腔科门诊',0.03553719],
            ['2016/01','呼吸科门诊',0.316095669],
            ['2016/01','妇科急诊',0.346666667],
            ['2016/01','妇科门诊',0.350495805],
            ['2016/01','心内科门诊',0.201040681],
            ['2016/01','心血管外科门诊',-0.333333333],
            ['2016/01','急诊内科',0.004084886],
            ['2016/01','放射诊疗科门诊',null],
            ['2016/01','普内科门诊',-0.127390834],
            ['2016/01','普外科急诊',0.070133011],
            ['2016/01','普外科门诊',-0.033601169],
            ['2016/01','泌尿科急诊',0.092682927],
            ['2016/01','泌尿科门诊',0.508287293],
            ['2016/01','消化科门诊',0.151006711],
            ['2016/01','生殖医学科门诊',null],
            ['2016/01','疼痛科门诊',-0.002739726],
            ['2016/01','皮肤科门诊',0.14479638],
            ['2016/01','眼科门诊',0.594618056],
            ['2016/01','神外科急诊',0.239709443],
            ['2016/01','神外科门诊',0.110132159],
            ['2016/01','神经内科急诊',0.092307692],
            ['2016/01','神经内科门诊',0.219640509],
            ['2016/01','老年科门诊',0.27986065],
            ['2016/01','耳鼻咽喉科急诊',null],
            ['2016/01','耳鼻咽喉科门诊',0.475226797],
            ['2016/01','肾内科血透中心',0.437869822],
            ['2016/01','肾内科门诊',0.068965517],
            ['2016/01','肿瘤微创介入科门诊',null],
            ['2016/01','胸外科急诊',0.059360731],
            ['2016/01','胸外科门诊',0.07253886],
            ['2016/01','膏方门诊',null],
            ['2016/01','营养科门诊',null],
            ['2016/01','血液科门诊',0.296703297],
            ['2016/01','血管外科急诊',0.545454545],
            ['2016/01','血管外科门诊',0.566433566],
            ['2016/01','超声医学科门诊',-0.557971014],
            ['2016/01','针灸科门诊',0.728212703],
            ['2016/01','门诊计划生育',-0.012276786],
            ['2016/01','风湿病科门诊',0.623752495],
            ['2016/01','骨科急诊',0.09608091],
            ['2016/01','骨科门诊',0.126356318],
            ['2016/01','高压氧舱',-0.033333333],
            ['2016/01','麻醉科门诊',null],
            ['2016/02','中医科门诊',0.161505768],
            ['2016/02','产科门诊',1.195899772],
            ['2016/02','健康管理中心',1.734693878],
            ['2016/02','儿科急诊',-0.159975669],
            ['2016/02','儿科门诊',-0.023546726],
            ['2016/02','内分泌科门诊',0.536423841],
            ['2016/02','内窥镜门诊',null],
            ['2016/02','口腔科门诊',0.372863248],
            ['2016/02','呼吸科门诊',0.544117647],
            ['2016/02','妇科急诊',0.845588235],
            ['2016/02','妇科门诊',0.607338445],
            ['2016/02','心内科门诊',0.286042504],
            ['2016/02','心血管外科门诊',1.357142857],
            ['2016/02','急诊内科',0.099553287],
            ['2016/02','放射科门诊',0],
            ['2016/02','放射诊疗科门诊',null],
            ['2016/02','普内科门诊',-0.003395586],
            ['2016/02','普外科急诊',0.469135802],
            ['2016/02','普外科门诊',0.213231552],
            ['2016/02','泌尿科急诊',0.120805369],
            ['2016/02','泌尿科门诊',0.580895009],
            ['2016/02','消化科门诊',0.259083728],
            ['2016/02','生殖医学科门诊',null],
            ['2016/02','疼痛科门诊',0.126811594],
            ['2016/02','皮肤科门诊',0.370309951],
            ['2016/02','眼科门诊',0.728184554],
            ['2016/02','神外科急诊',0.372],
            ['2016/02','神外科门诊',0.304635762],
            ['2016/02','神经内科急诊',0.246406571],
            ['2016/02','神经内科门诊',0.422641509],
            ['2016/02','老年科门诊',0.401244813],
            ['2016/02','耳鼻咽喉科急诊',null],
            ['2016/02','耳鼻咽喉科门诊',0.701213819],
            ['2016/02','肾内科血透中心',0.222222222],
            ['2016/02','肾内科门诊',0.344202899],
            ['2016/02','肿瘤微创介入科门诊',null],
            ['2016/02','胸外科急诊',0.212765957],
            ['2016/02','胸外科门诊',0.133858268],
            ['2016/02','营养科门诊',0.75],
            ['2016/02','血液科门诊',0.477876106],
            ['2016/02','血管外科急诊',0.222222222],
            ['2016/02','血管外科门诊',0.858156028],
            ['2016/02','超声医学科门诊',-0.125],
            ['2016/02','针灸科门诊',0.880357143],
            ['2016/02','门诊计划生育',0.411302983],
            ['2016/02','风湿病科门诊',0.66552901],
            ['2016/02','骨科急诊',0.080769231],
            ['2016/02','骨科门诊',0.347092765],
            ['2016/02','高压氧舱',0.272727273],
            ['2016/02','麻醉科门诊',null],
            ['2016/03','中医科门诊',0.127115309],
            ['2016/03','产科门诊',1.331266608],
            ['2016/03','健康管理中心',0.51793722],
            ['2016/03','儿科急诊',0.211583924],
            ['2016/03','儿科门诊',0.191358025],
            ['2016/03','内分泌科门诊',0.643767705],
            ['2016/03','内窥镜门诊',null],
            ['2016/03','发热门诊',null],
            ['2016/03','口腔科门诊',0.340229885],
            ['2016/03','呼吸科门诊',0.625864454],
            ['2016/03','妇科急诊',1.108433735],
            ['2016/03','妇科门诊',0.543632439],
            ['2016/03','心内科门诊',0.288249211],
            ['2016/03','心血管外科门诊',1.064516129],
            ['2016/03','急诊内科',0.226445613],
            ['2016/03','放射科门诊',0],
            ['2016/03','放射诊疗科门诊',null],
            ['2016/03','普内科门诊',0.129411765],
            ['2016/03','普外科急诊',0.367318436],
            ['2016/03','普外科门诊',0.132220367],
            ['2016/03','泌尿科急诊',0.463157895],
            ['2016/03','泌尿科门诊',0.67706528],
            ['2016/03','消化科门诊',0.302442079],
            ['2016/03','生殖医学科门诊',null],
            ['2016/03','疼痛科门诊',0.13559322],
            ['2016/03','皮肤科门诊',0.280487805],
            ['2016/03','眼科急诊',null],
            ['2016/03','眼科门诊',0.542257866],
            ['2016/03','神外科急诊',0.824104235],
            ['2016/03','神外科门诊',0.294545455],
            ['2016/03','神经内科急诊',0.211598746],
            ['2016/03','神经内科门诊',0.564932563],
            ['2016/03','老年科门诊',0.206126975],
            ['2016/03','耳鼻咽喉科急诊',null],
            ['2016/03','耳鼻咽喉科门诊',0.391951488],
            ['2016/03','肾内科血透中心',-0.011904762],
            ['2016/03','肾内科门诊',0.092273068],
            ['2016/03','肿瘤微创介入科门诊',null],
            ['2016/03','胸外科急诊',0.820512821],
            ['2016/03','胸外科门诊',0.302325581],
            ['2016/03','膏方门诊',null],
            ['2016/03','营养科门诊',13.66666667],
            ['2016/03','血液科门诊',0.590909091],
            ['2016/03','血管外科急诊',1.25],
            ['2016/03','血管外科门诊',0.834170854],
            ['2016/03','超声医学科门诊',-0.180451128],
            ['2016/03','针灸科门诊',0.524137931],
            ['2016/03','门诊计划生育',0.372620127],
            ['2016/03','风湿病科门诊',0.68158474],
            ['2016/03','骨科急诊',0.540212443],
            ['2016/03','骨科门诊',0.271096159],
            ['2016/03','高压氧舱',-0.12244898],
            ['2016/03','麻醉科门诊',null],
            ['2016/04','中医科门诊',0.028867839],
            ['2016/04','产科门诊',1.026845638],
            ['2016/04','健康管理中心',0.236009732],
            ['2016/04','儿科急诊',0.042836041],
            ['2016/04','儿科门诊',0.041745731],
            ['2016/04','内分泌科门诊',0.386329866],
            ['2016/04','内窥镜门诊',null],
            ['2016/04','发热门诊',null],
            ['2016/04','口腔科门诊',0.162985529],
            ['2016/04','呼吸科门诊',0.544223108],
            ['2016/04','妇科急诊',0.912087912],
            ['2016/04','妇科门诊',0.399514268],
            ['2016/04','心内科门诊',0.199164345],
            ['2016/04','心血管外科门诊',1.368421053],
            ['2016/04','急诊内科',0.243067847],
            ['2016/04','放射科门诊',0.5],
            ['2016/04','放射诊疗科门诊',null],
            ['2016/04','普内科门诊',-0.204826929],
            ['2016/04','普外科急诊',0.59811617],
            ['2016/04','普外科门诊',0.135477249],
            ['2016/04','泌尿科急诊',0.320930233],
            ['2016/04','泌尿科门诊',0.407605785],
            ['2016/04','消化科门诊',0.206857658],
            ['2016/04','生殖医学科门诊',null],
            ['2016/04','疼痛科门诊',-0.205263158],
            ['2016/04','皮肤科门诊',0.134766649],
            ['2016/04','眼科急诊',null],
            ['2016/04','眼科门诊',0.24842226],
            ['2016/04','神外科急诊',0.575757576],
            ['2016/04','神外科门诊',0.303418803],
            ['2016/04','神经内科急诊',0.088098918],
            ['2016/04','神经内科门诊',0.264246682],
            ['2016/04','老年科门诊',0.149609162],
            ['2016/04','耳鼻咽喉科急诊',null],
            ['2016/04','耳鼻咽喉科门诊',0.260124611],
            ['2016/04','肾内科血透中心',0.079295154],
            ['2016/04','肾内科门诊',-0.005503145],
            ['2016/04','肿瘤微创介入科门诊',null],
            ['2016/04','胸外科急诊',0.85],
            ['2016/04','胸外科门诊',0.232044199],
            ['2016/04','营养科门诊',1.4375],
            ['2016/04','血液科门诊',0.134615385],
            ['2016/04','血管外科急诊',1.333333333],
            ['2016/04','血管外科门诊',0.536842105],
            ['2016/04','超声医学科门诊',-0.274509804],
            ['2016/04','针灸科门诊',0.539705882],
            ['2016/04','门诊计划生育',0.182425979],
            ['2016/04','风湿病科门诊',0.694333599],
            ['2016/04','骨科急诊',0.151960784],
            ['2016/04','骨科门诊',0.16552901],
            ['2016/04','高压氧舱',0.078947368],
            ['2016/04','麻醉科门诊',null],
            ['2016/05','',null],
            ['2016/05','中医科门诊',0.122266845],
            ['2016/05','产科门诊',1.200523104],
            ['2016/05','健康管理中心',0.408219178],
            ['2016/05','儿科急诊',0.047761194],
            ['2016/05','儿科门诊',0.195040214],
            ['2016/05','内分泌科门诊',0.464723926],
            ['2016/05','内窥镜门诊',0.806451613],
            ['2016/05','口腔科门诊',0.526054591],
            ['2016/05','呼吸科门诊',0.701566364],
            ['2016/05','妇科急诊',0.599078341],
            ['2016/05','妇科门诊',0.481309765],
            ['2016/05','心内科门诊',0.355792535],
            ['2016/05','心血管外科门诊',0.108108108],
            ['2016/05','急诊内科',0.173740241],
            ['2016/05','放射诊疗科门诊',null],
            ['2016/05','普内科门诊',0.055871886],
            ['2016/05','普外科急诊',0.33295838],
            ['2016/05','普外科门诊',0.145054945],
            ['2016/05','泌尿科急诊',0.215311005],
            ['2016/05','泌尿科门诊',0.473387922],
            ['2016/05','消化科门诊',0.305710306],
            ['2016/05','生殖医学科门诊',null],
            ['2016/05','疼痛科门诊',-0.16344086],
            ['2016/05','皮肤科门诊',0.311045072],
            ['2016/05','眼科门诊',0.319103522],
            ['2016/05','神外科急诊',0.331632653],
            ['2016/05','神外科门诊',0.266666667],
            ['2016/05','神经内科急诊',-0.139949109],
            ['2016/05','神经内科门诊',0.348899013],
            ['2016/05','老年科门诊',0.185741744],
            ['2016/05','耳鼻咽喉科急诊',null],
            ['2016/05','耳鼻咽喉科门诊',0.421451788],
            ['2016/05','肾内科血透中心',0.333333333],
            ['2016/05','肾内科门诊',0.15026362],
            ['2016/05','肿瘤微创介入科门诊',3.769230769],
            ['2016/05','胸外科急诊',0.194444444],
            ['2016/05','胸外科门诊',0.131868132],
            ['2016/05','营养科门诊',1.058823529],
            ['2016/05','血液科门诊',0.418060201],
            ['2016/05','血管外科急诊',0.083333333],
            ['2016/05','血管外科门诊',0.391304348],
            ['2016/05','超声医学科门诊',-0.427586207],
            ['2016/05','针灸科门诊',0.489820359],
            ['2016/05','门诊计划生育',0.421052632],
            ['2016/05','风湿病科门诊',0.57204611],
            ['2016/05','骨科急诊',0.125282167],
            ['2016/05','骨科门诊',0.278021978],
            ['2016/05','高压氧舱',0.157894737],
            ['2016/05','麻醉科门诊',0.916666667],
            ['2016/06','中医科门诊',-0.099327857],
            ['2016/06','产科门诊',1.28452579],
            ['2016/06','健康管理中心',0.237974684],
            ['2016/06','儿科急诊',0.026858513],
            ['2016/06','儿科门诊',0.076665924],
            ['2016/06','内分泌科门诊',0.215494792],
            ['2016/06','内窥镜门诊',1.5],
            ['2016/06','发热门诊',null],
            ['2016/06','口腔科门诊',0.460918614],
            ['2016/06','呼吸科门诊',0.905033238],
            ['2016/06','妇科急诊',1.119402985],
            ['2016/06','妇科门诊',0.304189435],
            ['2016/06','心内科门诊',0.075605681],
            ['2016/06','心血管外科门诊',0.181818182],
            ['2016/06','急诊内科',0.241735838],
            ['2016/06','放射诊疗科门诊',null],
            ['2016/06','普内科门诊',-0.097028958],
            ['2016/06','普外科急诊',0.465909091],
            ['2016/06','普外科门诊',0.175314212],
            ['2016/06','泌尿科急诊',0.267782427],
            ['2016/06','泌尿科门诊',0.276669558],
            ['2016/06','消化科门诊',0.20241372],
            ['2016/06','生殖医学科门诊',null],
            ['2016/06','疼痛科门诊',-0.198019802],
            ['2016/06','皮肤科门诊',0.24790841],
            ['2016/06','眼科急诊',null],
            ['2016/06','眼科门诊',0.398198198],
            ['2016/06','神外科急诊',0.420323326],
            ['2016/06','神外科门诊',0.126712329],
            ['2016/06','神经内科急诊',0.027662517],
            ['2016/06','神经内科门诊',0.285060976],
            ['2016/06','老年科门诊',0.102291877],
            ['2016/06','耳鼻咽喉科急诊',null],
            ['2016/06','耳鼻咽喉科门诊',0.28],
            ['2016/06','肾内科血透中心',0.255813953],
            ['2016/06','肾内科门诊',0.02195122],
            ['2016/06','肿瘤微创介入科门诊',1.172413793],
            ['2016/06','胸外科急诊',0.205741627],
            ['2016/06','胸外科门诊',0.275862069],
            ['2016/06','营养科门诊',1.714285714],
            ['2016/06','血液科门诊',0.490625],
            ['2016/06','血管外科急诊',-0.652173913],
            ['2016/06','血管外科门诊',0.596330275],
            ['2016/06','超声医学科门诊',-0.557692308],
            ['2016/06','针灸科门诊',0.01821061],
            ['2016/06','门诊计划生育',0.291242363],
            ['2016/06','风湿病科门诊',0.589446589],
            ['2016/06','骨科急诊',0.078453039],
            ['2016/06','骨科门诊',0.238442141],
            ['2016/06','高压氧舱',-0.5],
            ['2016/06','麻醉科门诊',0.80952381],
            ['2016/07','中医科门诊',-0.099122165],
            ['2016/07','产科门诊',0.556100552],
            ['2016/07','健康管理中心',2.290465632],
            ['2016/07','儿科急诊',-0.108486017],
            ['2016/07','儿科门诊',-0.171835381],
            ['2016/07','内分泌科门诊',0.160583942],
            ['2016/07','内窥镜门诊',0.542857143],
            ['2016/07','口腔科门诊',0.012802276],
            ['2016/07','呼吸科门诊',0.265667575],
            ['2016/07','妇科急诊',0.701149425],
            ['2016/07','妇科门诊',0.118607182],
            ['2016/07','心内科门诊',-0.059642147],
            ['2016/07','心血管外科门诊',0.595238095],
            ['2016/07','急诊内科',0.100150515],
            ['2016/07','放射诊疗科门诊',null],
            ['2016/07','普内科门诊',-0.148457584],
            ['2016/07','普外科急诊',0.766902119],
            ['2016/07','普外科门诊',0.028870648],
            ['2016/07','泌尿科急诊',0.519713262],
            ['2016/07','泌尿科门诊',0.02711616],
            ['2016/07','消化科门诊',0.090281884],
            ['2016/07','生殖医学科门诊',0.627118644],
            ['2016/07','疼痛科门诊',-0.081896552],
            ['2016/07','皮肤科门诊',0.141384389],
            ['2016/07','眼科急诊',null],
            ['2016/07','眼科门诊',0.0986733],
            ['2016/07','神外科急诊',0.176470588],
            ['2016/07','神外科门诊',0.00872093],
            ['2016/07','神经内科急诊',0.218181818],
            ['2016/07','神经内科门诊',0.094804318],
            ['2016/07','老年科门诊',-0.01939558],
            ['2016/07','耳鼻咽喉科急诊',null],
            ['2016/07','耳鼻咽喉科门诊',0.243868579],
            ['2016/07','肾内科血透中心',0.300469484],
            ['2016/07','肾内科门诊',0.008422665],
            ['2016/07','肿瘤微创介入科门诊',1.153846154],
            ['2016/07','胸外科急诊',0.598958333],
            ['2016/07','胸外科门诊',0.070895522],
            ['2016/07','营养科门诊',1.5],
            ['2016/07','血液科门诊',0.575079872],
            ['2016/07','血管外科急诊',-0.5],
            ['2016/07','血管外科门诊',0.097972973],
            ['2016/07','超声医学科门诊',-0.404580153],
            ['2016/07','针灸科门诊',0.031076067],
            ['2016/07','门诊计划生育',0.042060086],
            ['2016/07','风湿病科门诊',0.416091954],
            ['2016/07','骨科急诊',0.264367816],
            ['2016/07','骨科门诊',0.153457447],
            ['2016/07','高压氧舱',0.1875],
            ['2016/07','麻醉科门诊',0.620689655],
            ['2016/08','中医科门诊',0.051171171],
            ['2016/08','产科门诊',0.792010146],
            ['2016/08','健康管理中心',0.458033573],
            ['2016/08','儿科急诊',-0.220364742],
            ['2016/08','儿科门诊',-0.126537],
            ['2016/08','内分泌科门诊',0.479488904],
            ['2016/08','内窥镜门诊',0.404761905],
            ['2016/08','口腔科门诊',0.106504646],
            ['2016/08','呼吸科门诊',0.264222503],
            ['2016/08','妇科急诊',0.836820084],
            ['2016/08','妇科门诊',0.239694656],
            ['2016/08','心内科门诊',0.255178493],
            ['2016/08','心血管外科门诊',0.192307692],
            ['2016/08','急诊内科',-0.004863715],
            ['2016/08','放射诊疗科门诊',null],
            ['2016/08','普内科门诊',-0.026569343],
            ['2016/08','普外科急诊',0.622032289],
            ['2016/08','普外科门诊',0.225193108],
            ['2016/08','泌尿科急诊',0.606153846],
            ['2016/08','泌尿科门诊',0.252357601],
            ['2016/08','消化科门诊',0.326105088],
            ['2016/08','生殖医学科门诊',2.428571429],
            ['2016/08','疼痛科门诊',-0.028747433],
            ['2016/08','皮肤科门诊',0.284444444],
            ['2016/08','眼科急诊',null],
            ['2016/08','眼科门诊',0.354228856],
            ['2016/08','神外科急诊',0.115749526],
            ['2016/08','神外科门诊',0.215017065],
            ['2016/08','神经内科急诊',0.349072513],
            ['2016/08','神经内科门诊',0.300841515],
            ['2016/08','老年科门诊',0.054192812],
            ['2016/08','耳鼻咽喉科急诊',null],
            ['2016/08','耳鼻咽喉科门诊',0.427832385],
            ['2016/08','肾内科血透中心',0.362831858],
            ['2016/08','肾内科门诊',0.152766952],
            ['2016/08','肿瘤微创介入科门诊',1.769230769],
            ['2016/08','胸外科急诊',0.153846154],
            ['2016/08','胸外科门诊',0.412087912],
            ['2016/08','营养科门诊',2.615384615],
            ['2016/08','血液科门诊',0.601851852],
            ['2016/08','血管外科急诊',-0.428571429],
            ['2016/08','血管外科门诊',0.995475113],
            ['2016/08','超声医学科门诊',-0.336363636],
            ['2016/08','针灸科门诊',0.070488323],
            ['2016/08','门诊计划生育',0.040386304],
            ['2016/08','风湿病科门诊',0.519384265],
            ['2016/08','骨科急诊',0.034447822],
            ['2016/08','骨科门诊',0.254866338],
            ['2016/08','高压氧舱',-0.230769231],
            ['2016/08','麻醉科门诊',-0.3125],
            ['2016/09','中医科门诊',-0.106312292],
            ['2016/09','产科门诊',0.284646062],
            ['2016/09','健康管理中心',0.843672457],
            ['2016/09','儿科急诊',-0.148044693],
            ['2016/09','儿科门诊',-0.219695344],
            ['2016/09','内分泌科门诊',0.250316056],
            ['2016/09','内窥镜门诊',-0.097560976],
            ['2016/09','口腔科门诊',-0.24437299],
            ['2016/09','呼吸科门诊',0.00795107],
            ['2016/09','妇科急诊',0.417624521],
            ['2016/09','妇科门诊',0.07398018],
            ['2016/09','心内科门诊',0.007800312],
            ['2016/09','心血管外科门诊',0.114285714],
            ['2016/09','急诊内科',0.057278606],
            ['2016/09','放射科门诊',0],
            ['2016/09','放射诊疗科门诊',-0.625],
            ['2016/09','普内科门诊',-0.130647986],
            ['2016/09','普外科急诊',0.426439232],
            ['2016/09','普外科门诊',0.077894089],
            ['2016/09','泌尿科急诊',0.317406143],
            ['2016/09','泌尿科门诊',0.05317521],
            ['2016/09','消化科门诊',0.052798102],
            ['2016/09','生殖医学科门诊',0.220338983],
            ['2016/09','疼痛科门诊',-0.225099602],
            ['2016/09','皮肤科门诊',-0.010054462],
            ['2016/09','眼科门诊',0.065400844],
            ['2016/09','神外科急诊',-0.029684601],
            ['2016/09','神外科门诊',-0.15015015],
            ['2016/09','神经内科急诊',0.067774936],
            ['2016/09','神经内科门诊',0.069208587],
            ['2016/09','老年科门诊',-0.039989044],
            ['2016/09','耳鼻咽喉科急诊',14.5],
            ['2016/09','耳鼻咽喉科门诊',0.135226179],
            ['2016/09','肾内科血透中心',0.299180328],
            ['2016/09','肾内科门诊',0.03805668],
            ['2016/09','肿瘤微创介入科门诊',3.235294118],
            ['2016/09','胸外科急诊',-0.110655738],
            ['2016/09','胸外科门诊',-0.295202952],
            ['2016/09','营养科门诊',1.5],
            ['2016/09','血液科门诊',0.307692308],
            ['2016/09','血管外科急诊',-0.363636364],
            ['2016/09','血管外科门诊',0.388059701],
            ['2016/09','超声医学科门诊',-0.216216216],
            ['2016/09','针灸科门诊',-0.047029703],
            ['2016/09','门诊计划生育',-0.078291815],
            ['2016/09','风湿病科门诊',0.395390071],
            ['2016/09','骨科急诊',0.069370331],
            ['2016/09','骨科门诊',0.104981253],
            ['2016/09','高压氧舱',-0.676470588],
            ['2016/09','麻醉科门诊',1.085714286]
        ];

        $scope.growthTotal = {};
        $scope.growthTotal.options = {
            title: {
                text: '全院门急诊总量同环比'
            },
            tooltip : {
                trigger: 'axis'
            },
            legend: {
                data:['同比','环比']
            },
            dataZoom: [
                  {
                        type: 'slider',
                        show: true,
                        realtime: true,
                  }
            ],          
            xAxis : [
                {
                    type : 'category',
                    boundaryGap : false,
                    data : months
                }
            ],
            yAxis : [
                {
                    type : 'value',
                    axisLabel: {
                        formatter: function(value) {
                            return (value * 100).toFixed(1) + '%'
                        }
                    }
                },
            ],
            series : [
                {
                    name:'同比',
                    type:'line',
                    data:[0.143686134,0.311108823,0.344196973,0.218641317,0.288048693,0.221174125,0.094098023,0.181481202,0.031431328],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                },
                {
                    name:'环比',
                    type:'line',
                    data:[-0.150014413,-0.169473176,0.419857399,-0.127953278,0.089776763,-0.016073465,0.031962336,0.077809237,-0.147393834],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                }
            ]
        };

        $scope.countTotal = {};
        $scope.countTotal.options = {
            title: {
                text: '全院门急诊总量'
            },
            tooltip : {
                trigger: 'axis'
            },
            legend: {
                data:['门诊', '急诊']
            },
            dataZoom: [
                  {
                        type: 'slider',
                        show: true,
                        realtime: true,
                  }
            ],          
            xAxis : [
                {
                    type : 'category',
                    data : months
                }
            ],
            yAxis : [
                {
                    type : 'value'
                },
            ],
            series : [
                {
                    name:'门诊',
                    type:'bar',
                    data:[59929,50842,75018,64223,71043,69160,70554,77329,65562],
                    stack: '总量',
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                },
                {
                    name:'急诊',
                    type:'bar',
                    data:[16738,12832,15390,14617,14873,15377,16685,16698,14606],
                    stack: '总量',
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                }
            ]
        };

        $scope.growthMenzhen = {};
        $scope.growthMenzhen.options = {
            title: {
                text: '全院门诊总量同环比'
            },
            tooltip : {
                trigger: 'axis'
            },
            legend: {
                data:['同比','环比']
            },
            dataZoom: [
                  {
                        type: 'slider',
                        show: true,
                        realtime: true,
                  }
            ],          
            xAxis : [
                {
                    type : 'category',
                    boundaryGap : false,
                    data : months
                }
            ],
            yAxis : [
                {
                    type : 'value',
                    axisLabel: {
                        formatter: function(value) {
                            return (value * 100).toFixed(1) + '%'
                        }
                    }
                },
            ],
            series : [
                {
                    name:'同比',
                    type:'line',
                    data:[0.199683709,0.373773947,0.353211754,0.211000698,0.323922402,0.222340049,0.080227823,0.210175433,0.022808112],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                },
                {
                    name:'环比',
                    type:'line',
                    data:[-0.1885257,-0.151629428,0.475512372,-0.143898798,0.106192486,-0.026505074,0.02015616,0.096025739,-0.152168009],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                }
            ]
        };

        $scope.growthJizhen = {};
        $scope.growthJizhen.options = {
            title: {
                text: '全院急诊总量同环比'
            },
            tooltip : {
                trigger: 'axis'
            },
            legend: {
                data:['同比','环比']
            },
            dataZoom: [
                  {
                        type: 'slider',
                        show: true,
                        realtime: true,
                  }
            ],          
            xAxis : [
                {
                    type : 'category',
                    boundaryGap : false,
                    data : months
                }
            ],
            yAxis : [
                {
                    type : 'value',
                    axisLabel: {
                        formatter: function(value) {
                            return (value * 100).toFixed(1) + '%'
                        }
                    }
                },
            ],
            series : [
                {
                    name:'同比',
                    type:'line',
                    data:[-0.020080792, 0.11041883, 0.301920311, 0.253387069, 0.140305145, 0.215957615, 0.15691305, 0.064583997, 0.072],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                },
                {
                    name:'环比',
                    type:'line',
                    data:[0.023981402, -0.233361214, 0.199345387, -0.05022742, 0.017513854, 0.033886909, 0.085062106, 0.000779143, -0.125284465],
                    areaStyle: {normal: {}},
                    markPoint: {
                        data: [
                            {name: '最低', type: 'min'},
                            {name: '最高', type: 'max'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    },
                    markLine: {
                        data: [
                            {type: 'average', name: '平均值'}
                        ],
                        label: {
                            normal: {
                                formatter: '{b}'
                            }
                        }
                    }
                }
            ]
        };

        $scope.growthYearByDepartments = {};
        $scope.growthYearByDepartments.options = {
            title: {
                text: '科室急门诊量同比变化情况'
            },
            tooltip: {
                position: 'top',
                formatter: function(point) {
                    return point.seriesName + '<br>' + point.data[0] + ' ' + point.data[1] + ' ' + (point.data[2] * 100).toFixed(1) + '%'
                }
            },
            grid: {
                left: '3%',
                right: '4%',
                bottom: '6%',
                containLabel: true
            },
            xAxis: {
                type: 'category',
                data: months,
                axisLabel: {
                    interval: 0,
                    rotate: 35
                },
                splitArea: {
                    show: true
                }
            },
            yAxis: {
                type: 'category',
                data: departments,
                splitArea: {
                    show: true
                }
            },
            visualMap: {
                type: 'continuous',
                min: -1,
                max: 1,
                calculable: false,
                orient: 'horizontal',
                left: 'right',
                top: '0',
                inRange: {color: ['#008800', '#FFFFFF', '#880000']}
            },
            series: [{
                name: '同比变化',
                type: 'heatmap',
                data: dataGrowthYearByDepartments,
                label: {
                    normal: {
                        show: true
                    }
                },
                itemStyle: {
                    emphasis: {
                        shadowBlur: 10,
                        shadowColor: 'rgba(0, 0, 0, 0.5)'
                    }
                },
                label: null
            }]
        };

        $scope.countTotalPie = {};
        $scope.countTotalPie.options = {
            title: {
                text: '诊断类型和科室分布'
            },
            tooltip: {
                trigger: 'item',
                formatter: "{b}: {c} ({d}%)"
            },
            legend: {
                orient: 'vertical',
                x: 'left',
                y: 'bottom',
                data:['门诊','急诊','儿科门诊','骨科门诊','普外科门诊','神经内科门诊','普内科门诊','泌尿科门诊','心内科门诊','中医科门诊','皮肤科门诊','产科门诊','耳鼻咽喉科门诊','眼科门诊','风湿病科门诊','儿科急诊','呼吸科门诊','内分泌科门诊','口腔科门诊','针灸科门诊','肾内科门诊','普外科急诊','门诊计划生育','其他']
            },
            series: [
                {
                    name:'诊断类型',
                    type:'pie',
                    selectedMode: 'multiple',
                    radius: [0, '40%'],

                    label: {
                        normal: {
                            position: 'inner'
                        }
                    },
                    labelLine: {
                        normal: {
                            show: false
                        }
                    },
                    data:[
                        {value:603660, name:'门诊', selected:true},
                        {value:137816, name:'急诊'}
                    ]
                },
                {
                    name:'科室',
                    type:'pie',
                    radius: ['55%', '78%'],
                    data:[
                        {value:39136, name:'儿科门诊'},
                        {value:37255, name:'骨科门诊'},
                        {value:30294, name:'普外科门诊'},
                        {value:29938, name:'神经内科门诊'},
                        {value:24368, name:'普内科门诊'},
                        {value:24251, name:'泌尿科门诊'},
                        {value:23797, name:'心内科门诊'},
                        {value:22688, name:'中医科门诊'},
                        {value:22337, name:'皮肤科门诊'},
                        {value:22273, name:'产科门诊'},
                        {value:21687, name:'耳鼻咽喉科门诊'},
                        {value:20428, name:'眼科门诊'},
                        {value:19648, name:'风湿病科门诊'},
                        {value:18292, name:'儿科急诊'},
                        {value:17686, name:'呼吸科门诊'},
                        {value:17113, name:'内分泌科门诊'},
                        {value:13619, name:'口腔科门诊'},
                        {value:13410, name:'针灸科门诊'},
                        {value:11563, name:'肾内科门诊'},
                        {value:10997, name:'普外科急诊'},
                        {value:10589, name:'门诊计划生育'},
                        {value:55416, name:'其他'}
                    ]
                }
            ]
        };

    }
})(); 
